{
  "games": [
    {
      "name": "Slope",
      "slug": "slope",
      "type": "html",
      "url": "data/games/slope/index.html",
      "thumb": "data/thumbs/slope.png",
      "description": "Slope is a fun endless running game created by RobKayS. Guide a rolling ball down a steep, neon-lit slope while avoiding obstacles and staying on the platform. Be careful – if you hit a red block or fall off the edge, it's game over! Play Slope and experience what life is like racing at breakneck speeds through an infinite 3D course. If you succeed, you'll rack up high scores and test your reflexes – but be careful, the speed keeps increasing and the course gets more treacherous! Experience Slope online right from your browser with Classroom-gg and test your reaction time and hand-eye coordination skills. You can play Slope for free, but one wrong move will end your run.",
      "instructions": "Controls:
Arrow Keys or A/D - Steer left and right
Tips and tricks:

Don't be afraid to make small adjustments rather than sharp turns to maintain control.
Use the anticipation skills you've developed to look ahead and plan your path before obstacles appear!

About the creator:
Slope is created by RobKayS, known for developing addictive skill-based arcade games with minimalist design.",
      "category": "Action"
    },
    {
      "name": "Run 3",
      "slug": "run-3",
      "type": "html",
      "url": "data/games/run-3/index.html",
      "thumb": "data/thumbs/run3.png",
      "description": "Run 3 is a fun endless runner game created by Player 03. Navigate through space tunnels by running and jumping while gravity shifts around you. Be careful – if you fall into the void or hit obstacles, you'll have to restart from the last checkpoint! Play Run 3 and experience what life is like running through an infinite cosmic obstacle course. If you succeed, you'll unlock new characters and discover secret tunnels – but be careful, levels get more complex with rotating gravity and challenging gaps! Experience Run 3 online right from your browser with Classroom-gg and test your spatial awareness and platforming skills. You can play Run 3 for free, but a wrong jump will send you into space.",
      "instructions": "Controls:
Arrow Keys or WASD - Move and jump
Space - Jump
Tips and tricks:

Don't be afraid to use the walls and ceiling as the floor when gravity shifts.
Use the different characters you've unlocked – each has unique abilities that help in specific tunnel types!

About the creator:
Run 3 is created by Player 03, known for developing the popular Run series with innovative gravity-based mechanics.",
      "category": "Action"
    },
    {
      "name": "Super Mario Flash",
      "slug": "super-mario-flash",
      "type": "swf",
      "url": "data/games/super-mario-flash/super-mario-flash.swf",
      "thumb": "data/thumbs/super-mario-flash.png",
      "description": "Super Mario Flash is a fun platformer game created by Pouetpu. Play through classic Mario-style levels or create your own using the built-in level editor. Be careful – if you fall into pits or get hit by enemies too many times, you'll lose a life! Play Super Mario Flash and experience what life is like in a fan-made tribute to the iconic Mario series. If you succeed, you'll complete all levels and even design your own challenges – but be careful, tough platforming and enemies await! Experience Super Mario Flash online right from your browser with Classroom-gg and test your platforming and creativity skills. You can play Super Mario Flash for free, but a wrong jump will cost you progress.",
      "instructions": "Controls:
Arrow Keys - Move
Shift or A - Jump
Ctrl or S - Run/Shoot fireballs
Tips and tricks:

Don't be afraid to explore levels thoroughly for hidden power-ups and secret areas.
Use the level editor you've discovered to create and share your own custom Mario challenges!

About the creator:
Super Mario Flash is created by Pouetpu, a fan developer who created this beloved Flash tribute to Nintendo's Super Mario series.",
      "category": "Platformer"
    },
        {
      "name": "Retro Bowl",
      "slug": "rtro-bowl",
      "type": "html",
      "url": "data/games/retro-bowl/index.html",
      "thumb": "data/thumbs/retrobowl.png",
      "description": "Retro Bowl is a fun American football game created by New Star Games. Manage your team and lead them to championship glory with strategic plays and precise throws. Be careful – if you make too many incomplete passes or bad decisions, you'll lose the game! Play Retro Bowl and experience what life is like as both a coach and quarterback in retro-style football. If you succeed, you'll win the Retro Bowl championship – but be careful, managing roster, press, and gameplay requires skill! Experience Retro Bowl online right from your browser with Classroom-gg and test your strategy and timing skills. You can play Retro Bowl for free, but poor management will cost you victories.",
      "instructions": "Controls:
Mouse - Aim and throw passes
Click - Select plays and make decisions
WASD - Control player movement
Tips and tricks:

Don't be afraid to invest in your offense early – a strong receiving corps wins games.
Use the play-calling strategy you've learned to read defenses and exploit mismatches!

About the creator:
Retro Bowl is created by New Star Games, known for developing engaging sports management games with retro aesthetics.",
      "category": "Platformer"
    },
    {
      "name": "Bloons Tower Defense 4",
      "slug": "bloons-td-4",
      "type": "swf",
      "url": "data/games/bloons-td-4/bloonstd4.swf",
      "thumb": "data/thumbs/bloons-td-4.png",
      "description": "Bloons Tower Defense 4 is a fun tower defense game created by Ninja Kiwi. Strategically place monkey towers along the path to pop waves of colorful bloons before they escape. Be careful – if too many bloons get through, you'll lose lives and fail the level! Play Bloons Tower Defense 4 and experience what life is like defending against endless bloon invasions. If you succeed, you'll unlock harder tracks and tougher bloon types – but be careful, each round gets more challenging! Experience Bloons Tower Defense 4 online right from your browser with Classroom-gg and test your strategy and planning skills. You can play Bloons Tower Defense 4 for free, but a wrong tower placement will cost you the game.",
      "instructions": "Controls:
Mouse - Select and place towers
Click - Upgrade towers and activate abilities
Tips and tricks:

Don't be afraid to save money for crucial upgrades rather than placing too many weak towers.
Use the tower combinations you've discovered to handle different bloon types effectively, especially the tough MOAB-class bloons!

About the creator:
Bloons Tower Defense 4 is created by Ninja Kiwi, a New Zealand-based game developer famous for the beloved Bloons franchise.",
      "category": "Tower Defense"
    },
    {
      "name": "1v1.LOL",
      "slug": "1v1-lol",
      "type": "html",
      "url": "https://1v1-lolunblocked.gitlab.io/file/",
      "thumb": "data/thumbs/1v1-lol.png",
      "description": "1v1.lol is a fun building and shooting game created by JustPlay.LOL. Battle opponents in fast-paced 1v1 matches where you can build structures and eliminate enemies. Be careful – if your opponent builds faster or shoots more accurately, you'll be eliminated! Play 1v1.lol and experience what life is like in competitive building combat similar to popular battle royale games. If you succeed, you'll win rounds and improve your rank – but be careful, skilled players can build and shoot simultaneously! Experience 1v1.lol online right from your browser with Classroom-gg and test your building and shooting skills. You can play 1v1.lol for free, but slow building will leave you exposed.",
      "instructions": "Controls:
WASD - Move
Left Click - Shoot
Right Click - Aim
Q/C/V/B - Build structures (walls, floors, stairs, roofs)
Space - Jump
Tips and tricks:

Don't be afraid to practice building muscle memory in the training mode first.
Use the high ground advantage you've gained through building to get better shooting angles on opponents!

About the creator:
1v1.lol is created by JustPlay.LOL, known for developing competitive multiplayer games with building mechanics.",
      "category": "Shooter"
    },
    {
      "name": "Snake",
      "slug": "snake",
      "type": "html",
      "url": "https://www.google.com/fbx?fbx=snake_arcade&fbxga=1&hl=en&origin=www.google.com",
      "thumb": "data/thumbs/snake.png",
      "description": "Snake is a fun classic arcade game created by Gremlin Industries. Control a growing snake and eat food to increase your length while avoiding walls and your own tail. Be careful – if you crash into yourself or the boundaries, it's game over! Play Snake and experience what life is like in one of gaming's most iconic challenges. If you succeed, you'll achieve high scores and fill the screen – but be careful, the longer you get, the harder it becomes to maneuver! Experience Snake online right from your browser with Classroom-gg and test your planning and reflexes skills. You can play Snake for free, but one wrong turn will end your run.",
      "instructions": "Controls:
Arrow Keys or WASD - Change direction
Tips and tricks:

Don't be afraid to follow the edges of the screen to create more space in the center.
Use the spiral pattern you've learned to safely navigate as your snake grows longer!

About the creator:
Snake is a classic game concept originally created by Gremlin Industries, reimagined in countless versions across gaming history.",
      "category": "Classic"
    }
  ]
}